data = [
  {
    "question": "Відкриті члени класу мають мати модифікатор доступу?",
    "answers": [
      "public",
      "private",
      "protected",
      "opened"
    ]
  },
  {
    "question": "Методи члени класу це - ?",
    "answers": [
      "Функції-члени класу",
      "Змінні-члени класу",
      "Алгоритми на яких базується організація інформації та функціонування класу",
      "Динамічно виділена область пам’яті"
    ]
  },
  {
    "question": "Чи можна створити двовимірний динамічний масив цілочисельних змінних з оператором new?",
    "answers": [
      "Так",
      "Ні"
    ]
  },
  {
    "question": "Чи можна створити двовимірний динамічний масив цілочисельних змінних з оператором new[]?",
    "answers": [
      "Так",
      "Ні"
    ]
  },
  {
    "question": "Клас визначає новий тип даних, який задає формат?",
    "answers": [
      "об’єкта",
      "суб’єкта",
      "змінної",
      "функції"
    ]
  },
  {
    "question": "Поняття екземпляр класу тотожне з поняттям - ?",
    "answers": [
      "Об’єкт класу",
      "Метод класу",
      "Змінна класу",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "Які члени класу ідуть перші за замовчуванням?",
    "answers": [
      "private",
      "public",
      "protected",
      "closed"
    ]
  },
  {
    "question": "Вкажіть правильне оголошення класу?",
    "answers": [
      "class myClass {double a;};",
      "class my Class {double a;};",
      "class myClass::myClass {double a;};",
      "class myClass::~myClass{double a = 0;};"
    ]
  },
  {
    "question": "Яка основна відмінності між структурою та класом?",
    "answers": [
      "Доступність змінних за замовчуванням",
      "Структура старіший метод організації даних а клас новіший",
      "Структура створена у мові С а клас у С++",
      "Структура не підтримується мовою С++"
    ]
  },
  {
    "question": "Вбудованою називається фунакція - ?",
    "answers": [
      "Програмний код якої підставляється в те місце рядка програми, з якого вона викликається",
      "Програмний код якої підставляється в наступний рядок програми, з якого вона викликається",
      "Яка вписана в текст програми",
      "Яка оголошена в тексті програми"
    ]
  },
  {
    "question": "Який модифікатор передує вбудованій функції?",
    "answers": [
      "inline",
      "builded",
      "setin",
      "outline"
    ]
  },
  {
    "question": "Вкажіть вбудовану функцію?",
    "answers": [
      "inline int Fun(){//...}",
      "inline Fun(){//...}",
      "int Fun(){//...}",
      "void Fun(){//...}"
    ]
  },
  {
    "question": "Конструктор - ?",
    "answers": [
      "це спеціальна функція-член класу, яка викликається при створенні об'єкта",
      "це спеціальна функція, яка викликається при створенні об'єкта",
      "це спеціальна функція-член класу, яка викликається при знищенні об'єкта",
      "це спеціальна функція-член класу, яка викликається при модернізації об'єкта"
    ]
  },
  {
    "question": "Виберіть правильне оголошення конструктора для класу timerClass?",
    "answers": [
      "timerClass();",
      "int timerClass();",
      "construct timerClass();",
      "timerClass:: timerClass;"
    ]
  },
  {
    "question": "Чи можна перевизначати (перевантажувати) конструктор?",
    "answers": [
      "Так",
      "Ні"
    ]
  },
  {
    "question": "Виберіть параметризований конструктор?",
    "answers": [
      "timerClass(char *t);",
      "timerClass();",
      "int timerClass(int xv, int sec);",
      "~timerClass(int hod, int xv, int sec);"
    ]
  },
  {
    "question": "Який символ передує деструктору?",
    "answers": [
      "\"~\"",
      "\"-\"",
      "\"::\"",
      "\"->\""
    ]
  },
  {
    "question": "Чи можна оголошувати деструктор із параметрами?",
    "answers": [
      "Ні",
      "Так"
    ]
  },
  {
    "question": "Виберіть правильне оголошення деструктора для класу myClass?",
    "answers": [
      "~myClass() ",
      "->myClass() { cout << \"Руйнування об'єкта\" << endl;}",
      "-myClass() { cout << \"Руйнування об'єкта\" << endl;}",
      "myClass ::myClass() { cout << \"Руйнування об'єкта\" << endl;}"
    ]
  },
  {
    "question": "Виберіть правильне оголошення масиву об’єктів класу myClass?",
    "answers": [
      "myClass A[10];",
      "myClassA[10];",
      "myClass A[];",
      "myClass::myClass A=10;"
    ]
  },
  {
    "question": "Чи необхідно звільняти динамічно виділену область пам’яті?",
    "answers": [
      "Так",
      "Ні"
    ]
  },
  {
    "question": "Хто може звертатись до закритих членів класу?",
    "answers": [
      "Будь-які члени класу",
      "Тільки закриті члени класу",
      "Будь-який клас",
      "Будь-який код у програмі"
    ]
  },
  {
    "question": "Хто може звертатись до відкритих членів класу?",
    "answers": [
      "Будь-який код у програмі",
      "Будь-які члени класу",
      "Тільки закриті члени класу",
      "Будь-який клас"
    ]
  },
  {
    "question": "Який оператор звільняє динамічно виділену область пам’яті масиву?",
    "answers": [
      "delete []",
      "delete",
      "clear",
      "erase"
    ]
  },
  {
    "question": "Яка настанова звільняє динамічно виділену область пам’яті із змінної x?",
    "answers": [
      "delete x;",
      "delete [] x;",
      "clear x;",
      "erase x;"
    ]
  },
  {
    "question": "Виберіть унарні оператори?",
    "answers": [
      "\"-\", \"!\", \"+\", \"*\", \"~\", \"++\", \"--\"",
      "\"-\", \"%\", \">\", \"*\", \"&&\", \"==\", \"--\"",
      "\"-\", \"/\", \"<\", \"*\", \"||\", \"==\", \"--\"",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "Виберіть бінарні оператори?",
    "answers": [
      "\"-\", \"%\", \">\", \"*\", \"&&\", \"==\", \"->\"",
      "\"-\", \"!\", \"+\", \"*\", \"~\", \"++\", \"--\"",
      "\"-\", \"/\", \"~\", \"*\", \"||\", \"==\", \"?:\"",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "Який із операторів є тернарний?",
    "answers": [
      "\"?:\"",
      "\"-\"",
      "\"%\"",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "Знайдіть помилку в оголошені класу myClass:?",
    "answers": [
      "myClass(int n);",
      "void Get(double, double);",
      "~Get (double, double);",
      "double Put();"
    ]
  },
  {
    "question": "Виберіть правильний варіант передачі аргументів конструктору?",
    "answers": [
      "myClass ObjA = myClass(24);",
      "myClass ObjA = 24;",
      "Всі варіанти є правильні",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "Скільки рівнів містить абстрактна базова еталонна модель взаємодії відкритих систем для комунікацій і розробки мережевих протоколів OSI?",
    "answers": [
      "7 рівнів;",
      "5 рівнів;",
      "9 рівнів;",
      "4 рівнів."
    ]
  },
  {
    "question": "Скільки рівнів містить IP / TCP стек протоколів мережі Інтернет?",
    "answers": [
      "5 рівнів;",
      "7 рівнів;",
      "9 рівнів;",
      "4 рівнів."
    ]
  },
  {
    "question": "На якому рівні моделі відкритих систем OSI забезпечує функціонування комп'ютерної мережі протокол OSPF?",
    "answers": [
      "мережному;",
      "фізичному;",
      "транспортному;",
      "канальному."
    ]
  },
  {
    "question": "Скільки рівнів адресів і які використовується для забезпечення адресації в мережі Інтернет?",
    "answers": [
      "3 - фізична (MAC-адреса), логічна (IP-адреса), адресапорта;",
      "1 - логічний адреса (IP);",
      "1 - фізичний (MAC-адреса);",
      "2 - логічний (IP-адреса), адресапорта."
    ]
  },
  {
    "question": "Скільки біт використовується для адресації в мережі Інтернет, якщо користуються протоколом IP v.4?",
    "answers": [
      "32 біти;",
      "16 біт;",
      "64 біти;",
      "128 біт."
    ]
  },
  {
    "question": "Скільки біт використовується для адресації в мережі Інтернет, якщо користуються протоколом IP v.6?",
    "answers": [
      "128 біт;",
      "16 біт;",
      "64 біти;",
      "32 біти."
    ]
  },
  {
    "question": "При проходженні даних по різних мережах розмір датаграми може мінятися. Який протокол забезпечує фрагментацію даних?",
    "answers": [
      "IP;",
      "TCP;",
      "ICMP;",
      "HTTP."
    ]
  },
  {
    "question": "Які протоколи забезпечують функціонування мережі Інтернет на транспортному рівні?",
    "answers": [
      "TCP, UDP;",
      "IP, OSPF, BGP;",
      "HTTP, FTP;",
      "SMPT, ICMP."
    ]
  },
  {
    "question": "Які функції протоколу ICMP?",
    "answers": [
      "протокол ICMP створений для усунення недоліків ІР протоколу - відсутності контролю помилок і механізмів допомоги в доставці;",
      "протокол ICMP забезпечує функціонування електронної пошти;",
      "протокол ICMP забезпечує передачу інформації від веб-серверів до користувачів;",
      "протокол ICMP забезпечує можливість групової розсилки повідомлень в мережі Інтернет."
    ]
  },
  {
    "question": "Яке призначення протоколу ТCP?",
    "answers": [
      "призначений для створення з'єднання, управління передачею та контролю помилок при передачі даних в мережах і підмережах TCP/IP;",
      "призначений для забезпечення передачі даних на фізичному рівні моделі OSI;",
      "призначений для контролю функціонування мереж і мережних пристроїв;",
      "призначений для забезпечення адресації в мережі Інтернет."
    ]
  },
  {
    "question": "Які протоколи використовують для створення VPN?",
    "answers": [
      "MPLS, L2TP, PPTP;",
      "IP, OSPF, BGP;",
      "HTTP, FTP, TCP;",
      "SMPT, ICMP, UDP."
    ]
  },
  {
    "question": "Які протоколи забезпечують функціонування електронної пошти?",
    "answers": [
      "SMTP, POP, IMAP;",
      "RIP, OSPF, BGP;",
      "HTTP, FTP, IP;",
      "SMPT, ICMP, UDP."
    ]
  },
  {
    "question": "Які протоколи забезпечують передачу даних в реальному масштабі часу?",
    "answers": [
      "RTP, SCTP;",
      "TCP, IP;",
      "UDP, FTP;",
      "HTTP, HTTPS."
    ]
  },
  {
    "question": "Яку функцію в комп'ютерних мережах виконують firewall-ами?",
    "answers": [
      "фільтрацію трафіку за певними правилами;",
      "забезпечення адресації в мережі Інтернет;",
      "захист локальних мереж від вірусів;",
      "забезпечення передачі електронної пошти."
    ]
  },
  {
    "question": "Яка мережа називається DMZ-мережею?",
    "answers": [
      "DMZ-мережа, яка розташована між двома firewall-ами;",
      "локальна мережа одного підприємства;",
      "віртуальна приватна мережа;",
      "локальна мережа військової частини."
    ]
  },
  {
    "question": "Які мережі називають VPN (віртуальні приватні мережі)?",
    "answers": [
      "мережа, яку створюють в існуючій мережі Інтернет з використанням додаткових протоколів, що забезпечують шифрування та цілісність трафіка;",
      "мережа, яка побудована з використанням радіозв'язку;",
      "мережа, що створюється з використанням окремих ліній дротового зв'язку, що належать конкретним підприємствам;",
      "мережа, що створюється виключно з використанням оптичних ліній зв'язку."
    ]
  },
  {
    "question": "Яку функцію в комп'ютерних мережах виконують IDS?",
    "answers": [
      "IDS автоматизує процес моніторингу, аналізу подій в комп'ютерній системі та захисту її від несанкціонованих дій;",
      "IDS здійснює фільтрацію трафіку за певними правилами;",
      "IDS забезпечую адресацію в мережі Інтернет;",
      "IDS забезпечує функціонування розсилки новин в мережі Інтернет."
    ]
  },
  {
    "question": "Які основні типи давачів мають мати хостові IDS?",
    "answers": [
      "аналізатори журналів, системних звертань, поведінки прикладень, давачі ознак і контролю цілісності файлів;",
      "мережні екрани, антивіруси, криптосистеми;",
      "аналізатори швидкості мережного трафіку, маршруту отримуваних повідомлень, перевірки ІР-адреси відправників електронної пошти;",
      "давачі напруги на системних дисках, маршрутизаторах, блоках живлення РС."
    ]
  },
  {
    "question": "З якою метою застосовують сканери вразливостей?",
    "answers": [
      "для перевірки конфігурації системи з точки зору безпеки інформації;",
      "для перевірки продуктивності РС;",
      "для перевірки ліцензії програмних продуктів;",
      "для перевірки вмісту електронної пошти."
    ]
  },
  {
    "question": "З якою метою застосовують програму JohntheRipper?",
    "answers": [
      "для зламування паролів;",
      "для побудови вірусних програм;",
      "для розробки графічних прикладень;",
      "для перевірки конфігурації системи з точки зору безпеки інформації."
    ]
  },
  {
    "question": "З якою метою застосовують програму L0phtCrack?",
    "answers": [
      "для зламування паролів;",
      "для перевірки ліцензії програмних продуктів;",
      "для перевірки конфігурації системи з точки зору безпеки інформації;",
      "для створення \"чорного входу\" в систему."
    ]
  },
  {
    "question": "З якою метою застосовують сніфери?",
    "answers": [
      "для прослуховування та аналізу мережних потоків;",
      "для захисту від шкідливого програмного коду;",
      "для розробки прикладного програмного забезпечення;",
      "для створення \"чорного входу\" в систему."
    ]
  },
  {
    "question": "З якою метою застосовують сукупність утиліт ISIC?",
    "answers": [
      "інструмент перевірки працездатності IP-стеку;",
      "для зламування паролів;",
      "для перевірки конфігурації системи з точки зору безпеки інформації;",
      "для судового аналізу інформації в РС."
    ]
  },
  {
    "question": "З якою метою застосовують інструменти EnCase?",
    "answers": [
      "для судового аналізу інформації в РС;",
      "для створення \"чорного входу\" в систему;",
      "для перевірки ліцензії програмних продуктів;",
      "для захисту від шкідливого програмного коду."
    ]
  },
  {
    "question": "З якою метою застосовують інструменти Forensictoolkit?",
    "answers": [
      "для судового аналізу інформації в РС;",
      "для віддаленого управління РС;",
      "для перевірки конфігурації системи з точки зору безпеки інформації;",
      "для перевірки продуктивності РС."
    ]
  },
  {
    "question": "З якою метою застосовують інструменти TheCoroner'sToolkit?",
    "answers": [
      "для судового аналізу інформації в РС;",
      "для зламування паролів;",
      "для перевірки конфігурації системи з точки зору безпеки інформації;",
      "для протоколювання системних подій."
    ]
  },
  {
    "question": "З якою метою застосовують програму BackOrifice?",
    "answers": [
      "для створення \"чорного входу\" в систему;",
      "для протоколювання системних подій;",
      "для захисту від шкідливого програмного коду;",
      "для розробки прикладного програмного забезпечення."
    ]
  },
  {
    "question": "З якою метою застосовують програму SubSeven?",
    "answers": [
      "для створення \"чорного входу\" в систему;",
      "для захисту від шкідливого програмного коду;",
      "для протоколювання системних подій;",
      "для захисту від шкідливого програмного коду."
    ]
  },
  {
    "question": "З якою метою використовують keylogger?",
    "answers": [
      "для реєстрації та передачі кожне натиснення на клавішу клавіатури комп'ютера;",
      "для віддаленого управління РС;",
      "для протоколювання системних подій;",
      "для захисту від шкідливого програмного коду."
    ]
  },
  {
    "question": "З якою метою застосовують стеганографію?",
    "answers": [
      "для надійного забезпечення приховування самого факту існування секретної інформації в тому або іншому середовищі;",
      "для швидкого запису усної мови;",
      "для зламування паролів;",
      "для розробки прикладного програмного забезпечення."
    ]
  },
  {
    "question": "Яківи знаєте загрози інформаційній безпеці за джерелами походження?",
    "answers": [
      "всі відповіді правильні;",
      "природного походження;",
      "техногенного характеру;",
      "антропогенного характеру."
    ]
  },
  {
    "question": "Як називаються загрози, які за виконання певного комплексу умов обов'язково відбудуться?",
    "answers": [
      "імовірні;",
      "неможливі;",
      "випадкові;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як називаються загрози, які за виконання певного комплексу умов ніколи не відбудуться?",
    "answers": [
      "неможливі;",
      "імовірні;",
      "випадкові;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як називаються загрози, що впливають на окремі елементи структури системи?",
    "answers": [
      "елементні;",
      "структурні;",
      "системні;",
      "недопустимі."
    ]
  },
  {
    "question": "Як називається служба, яка забезпечує захист від несанкціонованого доступу до інформації, що утримується в віддалених банках даних, або від несанкціонованого використання мережі?",
    "answers": [
      "служба керування доступом;",
      "служба цілісності інформації;",
      "служба цілісності даних;",
      "служба доставки."
    ]
  },
  {
    "question": "Як називаються ознаки, що дають змогу відрізнити один об'єкт від іншого?",
    "answers": [
      "демаскувальними;",
      "сигнальними;",
      "розпізнавальними;",
      "індивідуальними."
    ]
  },
  {
    "question": "Що описують видові демаскувальні ознаки?",
    "answers": [
      "зовнішній вид об'єкту;",
      "стан об'єкту в конкретний момент часу;",
      "ступінь випромінювання об'єкту;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Як поділяють сигнали за фізичною природою?",
    "answers": [
      "акустичні, електричні, магнітні;",
      "аналогові, дискретні;",
      "мовні, телеграфні, телевізійні;",
      "регулярні, випадкові."
    ]
  },
  {
    "question": "Що виступає основними джерелами інформації?",
    "answers": [
      "всі відповіді правильні;",
      "люди;",
      "документи;",
      "чернетки і відходи виробництва."
    ]
  },
  {
    "question": "Як називається спосіб захисту інформації в мережі шляхом її криптографічної оброблення?",
    "answers": [
      "маскування;",
      "регламентація;",
      "припущення;",
      "приховування."
    ]
  },
  {
    "question": "Як називається засоби, що призначені для захисту інформації шляхом її криптографічного перетворення?",
    "answers": [
      "криптографічні засоби;",
      "програмно-апаратні засоби;",
      "організаційні засоби;",
      "апаратні засоби."
    ]
  },
  {
    "question": "Як називаються механічні, електричні, електромеханічні, електронні, електронно-механічні та інші прилади, які функціонують автономно або вбудовуються чи з'єднуються з іншими засобами з метою блокування дії дестабілізаційних чинників та вирішення інших задач захисту інформації?",
    "answers": [
      "апаратні засоби;",
      "криптографічні засоби;",
      "програмно-апаратні засоби;",
      "організаційні засоби."
    ]
  },
  {
    "question": "Що може бути причиною виникнення електричних каналів проникнення інформації?",
    "answers": [
      "всі відповіді правильні;",
      "наведення електромагнітних випромінювань та сторонні провідники, що виходять за межі контрольованої зони;",
      "проникнення інформаційних сигналів у мережу електроживлення;",
      "проникнення інформаційних сигналів у коло заземлення."
    ]
  },
  {
    "question": "На які групи можна розділити технічні методи захисту інформації від витоку через побічні та наведені електромагнітні поля?",
    "answers": [
      "всі відповіді правильні;",
      "пасивні методи;",
      "активні методи;",
      "методи, засновані на застосуванні високо захищених елементів і технологій."
    ]
  },
  {
    "question": "Що належить до технічних заходів з використанням активних засобів?",
    "answers": [
      "просторове зашумлення;",
      "параметричне зашумлення;",
      "паралельне зашумлення;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Які основні розділи повинно включати технічне завдання?",
    "answers": [
      "всі відповіді правильні;",
      "вимоги до системи захисту інформації;",
      "вимоги до складу проектної та експлуатаційної документації;",
      "етапи виконання робіт."
    ]
  },
  {
    "question": "Що потрібно забезпечити у процесі реалізації первинних технічних заходів?",
    "answers": [
      "всі відповіді правильні;",
      "блокування каналів витоку інформації;",
      "блокування несанкціонованого доступу до інформації чи її носіїв;",
      "перевірку справності та працездатності технічних засобів."
    ]
  },
  {
    "question": "Яка з перерахованих функцій не входить до складу функцій антивірусного програмного забезпечення?",
    "answers": [
      "перевірка наявності закладок;",
      "повна перевірка системи;",
      "перевірка електронної пошти;",
      "перевірка макросценаріїв."
    ]
  },
  {
    "question": "Коли утворюються можливі канали витоку інформації?",
    "answers": [
      "всі відповіді правильні;",
      "під час проходження інформативних сигналів у колі заземлення;",
      "під час паразитної модуляції високочастотного сигналу;",
      "внаслідок хибних комутацій і несанкціонованих дій."
    ]
  },
  {
    "question": "Якими мають бути заходи захисту інформації?",
    "answers": [
      "бути відповідними загрозам;",
      "бути своєчасними;",
      "бути зрозумілими;",
      "мають відповідати нормативно-правовій базі."
    ]
  },
  {
    "question": "Ким здійснені загрози техногенного характеру?",
    "answers": [
      "здійснені внаслідок аварій на промислових чи транспортних об'єктах;",
      "здійснені людиною;",
      "здійснені природою;",
      "здійснені навмисно."
    ]
  },
  {
    "question": "Як називаються загрози, що не можуть призвести до колапсу системи?",
    "answers": [
      "допустимими;",
      "недопустимими;",
      "системні;",
      "імовірні."
    ]
  },
  {
    "question": "Ким здійснені загрози антропогенного характеру?",
    "answers": [
      "здійснені людиною;",
      "здійснені внаслідок транспортних аварій;",
      "здійснені природою;",
      "здійснені навмисно."
    ]
  },
  {
    "question": "Яка з перерахованих дій НЕ входить до процедури забезпечення захисту інформації, що зберігається на жорсткому диску?",
    "answers": [
      "автоматичне створення резервних копій інформації;",
      "систематичний контроль над процесом заміни, передачі і знищення інформації;",
      "систематична перевірка процесів знищення інформації;",
      "фізичний захист інформації, що включає інвентаризацію і обмеження доступу."
    ]
  },
  {
    "question": "Як називається тимчасова зупинка функціонування компонентів комп'ютерної системи, що відбувається в результаті дій неавторизованої сторони?",
    "answers": [
      "переривання;",
      "перехоплення;",
      "модифікація;",
      "фальсифікація."
    ]
  },
  {
    "question": "Що представляє собою технічний захист інформації?",
    "answers": [
      "діяльність, яка спрямована на забезпечення інженерно-технічними заходами конфіденційності, цілісності та доступності інформації;",
      "діяльність, яка спрямована на виконання закону про державну таємницю;",
      "діяльність, яка спрямована на забезпечення захисту інформації від несанкціонованого доступу;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Які основні засади визначає положення про технічний захист інформації?",
    "answers": [
      "правові та організаційні;",
      "моральні;",
      "технічні;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "В чому полягає головне завдання стандартів інформаційної безпеки?",
    "answers": [
      "у створенні основи для взаємодії між виробниками, споживачами та експертами з кваліфікації продуктів інформаційних технологій;",
      "у врегулюванні взаємовідносин в сфері інформаційної безпеки;",
      "у дотриманні положення про технічний захист інформації;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Які основні документи включені в систему нормативних документів із технічного захисту інформації в комп'ютерних системах від несанкціонованого доступу України?",
    "answers": [
      "всі відповіді правильні;",
      "загальні положення щодо захисту інформації в комп'ютерних системах від несанкціонованого доступу;",
      "класифікація автоматизованих систем і стандартні функціональні профілі захищеності оброблюваної інформації від несанкціонованого доступу;",
      "критерії оцінки захищеності інформації в комп'ютерних системах від несанкціонованого доступу."
    ]
  },
  {
    "question": "Які можливі канали витоку і джерела загроз безпеки інформації при веденні переговорів і використанні технічних засобів для оброблення та передачі інформації?",
    "answers": [
      "всі відповіді правильні;",
      "акустичне випромінювання інформативного мовного сигналу;",
      "електричні сигнали, що виникають за допомогою перетворення інформативного сигналу з акустичного в електричний;",
      "віброакустичні сигнали, що виникають за допомогою перетворення інформативного акустичного сигналу при впливі його на будівельні конструкції."
    ]
  },
  {
    "question": "Яка дія входить в комплекс організаційних заходів щодо забезпечення безпеки інформації?",
    "answers": [
      "розроблення та впровадження правил реалізації заходів захисту інформації;",
      "формування вимог до системи захисту у процесі створення автоматизованої системи;",
      "розподіл між користувачами необхідних реквізитів захисту;",
      "організація перевірок надійності функціонування системи захисту."
    ]
  },
  {
    "question": "Які принципи серед організаційних принципів використовуються для побудови системи захисту інформації?",
    "answers": [
      "принцип обмеження повноважень;",
      "принцип централізованого управління системою захисту;",
      "принцип розподілу обов'язків;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що означає модель “PDCA” при організації СУІБ згідно міжнародного стандарту ISO/IEC 27001?",
    "answers": [
      "планування, дія, перевірка, поліпшення",
      "планування, перепланування, корекція, виконання;",
      "перепланування, корекція, виконання, моніторинг;",
      "пізнання, документування, контроль, виконання;"
    ]
  },
  {
    "question": "Що є підставою для стандартизації у сфері інформаційної безпеки?",
    "answers": [
      "Усі відповіді правильні",
      "Необхідність вироблення єдиних вимог щодо інформаційної безпеки",
      "Необхідність вироблення єдиних підходів до розв’язання проблем інформаційноїбезпеки",
      "Необхідністьвиробленняєдинихякіснихпоказників для оцінкибезпекиінформаційнихсистем  ізасобівзахисту."
    ]
  },
  {
    "question": "Якіосновніобластістандартизаціїу сфері інформаційноїбезпеки?",
    "answers": [
      "Усівідповідіправильні",
      "Криптографія",
      "Управління ІБ",
      "Аудит ІБ"
    ]
  },
  {
    "question": "Якіє групистандартів у сфері ІБ, якимикеруються при створенні, сертифікації та експлуатації СУІБ?",
    "answers": [
      "Оціночністандарти та стандарти-специфікації",
      "Сертифікаційністандарти та стандартиуправліннябезперервністюбізнесу",
      "Експлуатаційні та нормативністандарти",
      "Сертифікаційні та експлуатаційністандарти"
    ]
  },
  {
    "question": "Яка організація НЕ належить до міжнароднихорганізацій з стандартизації?",
    "answers": [
      "Немаєправильноївідповіді",
      "ISO",
      "IEC",
      "ITU-T"
    ]
  },
  {
    "question": "Який міжнародний стандарт, що стосується СУІБ, введений в дію в Україні як національний?",
    "answers": [
      "ISO/IEC 27001",
      "ISO/IEC 27002",
      "ISO/IEC 27000",
      "ISO/IEC 27003"
    ]
  },
  {
    "question": "Яка організація в Україні займається питаннями впровадження міжнародних стандартів у сфері ІБ в національні стандарти, узагальненням світового досвіду у галузі стандартизації і впровадженням міжнародних стандартів?",
    "answers": [
      "Технічний комітет з стандартизації ТК-20 “Інформаційні технології”",
      "ДержавнаорганізаціяУкраїни з стандартизації",
      "Національнакомісія“Управління інформаційною безпекою”",
      "Державний союз з телекомунікації"
    ]
  },
  {
    "question": "Для якого типу організаційзастосовується стандартISO/IEC 27000?",
    "answers": [
      "Усіхтипіворганізацій",
      "Для комерційнихпідприємств",
      "Для урядовихустанов",
      "Для некомерційнихпідприємств"
    ]
  },
  {
    "question": "Щоміститьу собі стандарт ISO/IEC 27000?",
    "answers": [
      "Усівідповідіправильні",
      "Короткий описпроцесу“PCDA”",
      "Огляд сімейства стандартів СУІБ",
      "Терміни і визначення для використання їх у сімействі стандартів СУІБ"
    ]
  },
  {
    "question": "Яка назва стандарту ISO/IEC 27002?",
    "answers": [
      "Звід правил з управління ІБ.",
      "СУІБ. Вимоги.",
      "СУІБ. Загальнийогляд і термінологія.",
      "Настанови з реалізації СУІБ."
    ]
  },
  {
    "question": "Який стандарт визначає вимоги до розробки, впровадження, підтримки СУІБ у контексті організації?",
    "answers": [
      "ISO/IEC 27001",
      "ISO/IEC 27002",
      "ISO/IEC 27000",
      "ISO/IEC 27003"
    ]
  },
  {
    "question": "Яку кількість етапів передбачаєподана у стандарті ISO/IEC 27001 процесна модель “PCDA”розробки, впровадження, підтримки та постійного поліпшення СУІБ?",
    "answers": [
      "4",
      "3",
      "5",
      "7"
    ]
  },
  {
    "question": "Ким повинна бути затверджена політика ІБ?",
    "answers": [
      "Керівником організації.",
      "Директором з інформаційної безпеки.",
      "Начальником юридичного відділу.",
      "Немає правильної відповіді."
    ]
  },
  {
    "question": "Який вид політики інформаційної безпекиНЕ існує?",
    "answers": [
      "Орієнтованої на користувача",
      "Організаційної",
      "Орієнтованої на системи",
      "Орієнтованої на завдання"
    ]
  },
  {
    "question": "Кого рекомендується вводити до складу групи з розроблення політик інформаційної безпеки?",
    "answers": [
      "Усі відповіді правильні.",
      "Директора служби автоматизації.",
      "Представника юридичного відділу.",
      "Директора з інформаційної безпеки."
    ]
  },
  {
    "question": "Реалізацію яких заходів передбачає управління інформаційною безпекою?",
    "answers": [
      "Усі відповіді правильні.",
      "Управління ризиками ІБ",
      "Розроблення політик ІБ.",
      "Навчання персоналу з основ ІБ."
    ]
  },
  {
    "question": "Який стандарт НЕ належить до групи оціночних стандартів?",
    "answers": [
      "ISO/IEC 27000",
      "ISO/IEC 15408",
      "Оранжева книга",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "На яке питання відповідають стандарти-специфікації?",
    "answers": [
      "Як забезпечити інформаційну безпеку, які підходи, які методи і які засоби необхідно для цього використати.",
      "Чи відповідає інформаційна система, механізми і засоби захисту вимогам безпеки.",
      "Які методи необхідно застосовувати для моніторингу дотримання інформаційної безпеки.",
      "Немає правильної відповіді."
    ]
  },
  {
    "question": "Який орган в Україні здійснює сертифікацію СУІБ?",
    "answers": [
      "ТзОВ ”Сертифікаційний центр ”Стандарт”",
      "Український науково-дослідний інститут стандартизації, сертифікації та інформатики",
      "державне бюро сертифікації",
      "Немає правильної відповіді"
    ]
  },
  {
    "question": "У якому році були опубліковані останні версії стандартів ISO/IEC 27001 і 27002?",
    "answers": [
      "2013",
      "2012",
      "2009",
      "2005"
    ]
  },
  {
    "question": "У якому році була опублікована остання версія стандарту ISO/IEC 27000?",
    "answers": [
      "2014",
      "2009",
      "2012",
      "2013"
    ]
  },
  {
    "question": "Яку назву має «Оранжева книга”?",
    "answers": [
      "Критерії оцінки довіреної комп'ютерної системи",
      "Критерії оцінки безпеки інформаційної технології",
      "Звід правил з управління ІБ",
      "Управління ризиками ІБ"
    ]
  },
  {
    "question": "Що належить до статистичних атрибутів профілю загроз?",
    "answers": [
      "Усі відповіді правильні",
      "Загальний опис загрози",
      "Джерело загрози",
      "Наслідки реалізації загрози"
    ]
  },
  {
    "question": "Якою буде правильна послідовність загального життєвого циклу політики інформаційної безпеки з врахуванням, що 1 - розроблення політики безпеки; 2 - впровадження розробленої політики безпеки; 3 - проведення дослідження стану інформаційної безпеки; 4 - аналіз дотримання вимог впровадженої політики безпеки та формулювання вимог щодо її подальшого вдосконалення?",
    "answers": [
      "3 – 1 – 2 – 4;",
      "1 – 2 – 3 – 4;",
      "3 – 4 – 1 – 2;",
      "4 – 1 – 3 – 2"
    ]
  },
  {
    "question": "Хто є автором процесного підходу до управління (моделі ”PCDA”)?",
    "answers": [
      "Шухарт",
      "Вартон",
      "Шеннон",
      "Файоль"
    ]
  },
  {
    "question": "Що розуміють під шифруванням даних відповідно до стандарту ГОСТ 28147-89?",
    "answers": [
      "сукупність криптографічних перетворень множини вхідних даних до множини зашифрованих даних і навпаки, які задаються ключем і певним алгоритмом;",
      "сукупність математичних перетворень вхідної інформації до зашифрованих даних і навпаки, які задаються певним алгоритмом;",
      "сукупність картографічних перетворень множини вхідних даних до рельєфних зображень і навпаки, які задаються ключем і певним алгоритмом;",
      "сукупність алгоритмічних перетворень вхідної інформації до зашифрованих даних і навпаки, які задаються певним математичним виразом."
    ]
  },
  {
    "question": "Що розуміють під дешифруванням даних відповідно до стандарту ГОСТ 28147-89?",
    "answers": [
      "процес санкціонованого перетворення зашифрованих даних у придатну для читання інформацію мовою оригіналу;",
      "процес будь-якого перетворення даних у придатну для читання інформацію мовою оригіналу;",
      "процес санкціонованого перетворення зархівованих даних у читабельну інформацію;",
      "процес криптографічного перетворення даних у придатну для читання інформацію мовою оригіналу."
    ]
  },
  {
    "question": "Якою наукоювивчається процес шифрування/дешифрування даних відповідно до стандарту ГОСТ 28147-89?",
    "answers": [
      "криптографія;",
      "картографія;",
      "криптоаналіз;",
      "картоаналіз."
    ]
  },
  {
    "question": "Що розуміють під розшифруванням даних відповідно до стандарту ГОСТ 28147-89?",
    "answers": [
      "процес несанкціонованого отримання інформації з зашифрованих даних за відсутності ключа дешифрування;",
      "процес цілеспрямованого отримання інформації з зашифрованих даних за наявності ключа дешифрування;",
      "розархівування зашифрованих даних за допомогою ключа дешифрування;",
      "процес алгоритмічного отримання інформації з зашифрованих даних за наявності ключа дешифрування."
    ]
  },
  {
    "question": "Якою наукою вивчається процес розшифрування даних відповідно до стандарту ГОСТ 28147-89?",
    "answers": [
      "криптоаналіз;",
      "криптографія;",
      "картографія;",
      "картоаналіз."
    ]
  },
  {
    "question": "Що є основною характеристикою будь-якого шифру?",
    "answers": [
      "криптографічна стійкість;",
      "картографічна стійкість;",
      "наявність ключа шифрування/дешифрування;",
      "наявність досконалого алгоритму шифрування/дешифрування."
    ]
  },
  {
    "question": "Що називається криптографічною стійкістю шифру?",
    "answers": [
      "здатність чинити опір до розкриття методами криптографічного аналізу;",
      "здатність чинити опір до розкриття за відсутності ключа дешифрування;",
      "здатність перетворювати зашифровані дані у придатну для читання інформацію за відсутності ключа дешифрування;",
      "здатність чинити опір при дешифруванні даних за наявності ключа дешифрування."
    ]
  },
  {
    "question": "Яким параметром визначається криптографічна стійкість шифру?",
    "answers": [
      "наявним часом, який необхідно на його зламування при деяких фіксованих ресурсах, наявних у розпорядженні зловмисника;",
      "наявністю потужного комп'ютера, за допомогою якого зловмисник здійснює швидке зламування шифру;",
      "наявним ключем, який необхідно на його зламування при відсутності фіксованих ресурсів, потрібних зловмиснику швидкого зламування шифру;",
      "наявністю програмного забезпечення, придатного для здійснення частотного аналізу наявного вхідного повідомлення."
    ]
  },
  {
    "question": "В чому полягає процес шифрування даних методом переставляння?",
    "answers": [
      "символи вхідного тексту переставляються за певним правилом у межах деякого блоку цього тексту;",
      "символи вхідного тексту переставляються з одного блоку цього тексту в інший за певним правилом;",
      "символи вхідного тексту перетворюються в десятковий код і переставляються за певним правилом у межах іншого блоку цього тексту;",
      "символи вхідного тексту перетворюються в двійковий код і переставляються з одного блоку цього тексту в інший за певним правилом."
    ]
  },
  {
    "question": "В чому полягає процес шифрування даних методом заміни (підставляння)?",
    "answers": [
      "символи вхідного тексту замінюються символами того ж або іншого алфавіту відповідно до заздалегідь визначеної схеми заміни;",
      "символи вхідного тексту перетворюються в десятковий код і замінюються символами того ж або іншого алфавіту відповідно до заздалегідь визначеної схеми заміни;",
      "символи вхідного тексту замінюються десятковими числами відповідно до заздалегідь визначеної схеми заміни;",
      "символи вхідного тексту замінюються двійковими числами відповідно до заздалегідь визначеної схеми заміни."
    ]
  },
  {
    "question": "В чому полягає процес шифрування даних методом гамування?",
    "answers": [
      "символи вхідного тексту складаються з символами деякої випадкової послідовності, яку називають гамою шифру;",
      "символи вхідного повідомлення перемішуються з символами деякої випадкової послідовності, яку називають гамою шифру;",
      "символи початкового повідомлення складаються з символами деякої завчасно встановленої послідовності, яку називають ключем;",
      "символи вхідного повідомлення добавляють до символів деякої випадкової послідовності, яку називають ключем."
    ]
  },
  {
    "question": "Чим визначається стійкість шифрування даних методом гамування?",
    "answers": [
      "в основному довжиною (періодом) частини гами шифру, що не повторюється;",
      "переважно шириною (ротацією) частини гами шифру, що не повторюється;",
      "здебільшого фіксованою довжиною (періодом) частини гами шифру, що часто повторюється;",
      "зазвичай шириною (ротацією) частини гами шифру, що ніколи не повторюється."
    ]
  },
  {
    "question": "Оскільки за допомогою ЕОМ можна генерувати практично безмежну гаму шифрів, то в чому полягає основне завдання методу гамування?",
    "answers": [
      "у (де)шифруванні інформації за допомогою автоматизованих системах передавання інформації;",
      "у (де)шифруванні інформації за допомогою інформаційних системах передавання інформації;",
      "у кодуванні даних за допомогою архіваторів електронної інформації;",
      "у розпізнаванні графічних об'єктів, закодованих у двійковій системі числення."
    ]
  },
  {
    "question": "В чому полягає процес шифрування даних методом аналітичних перетворень?",
    "answers": [
      "вхідний текст перетворюється за деяким аналітичним правилом (формулою);",
      "вхідне повідомлення перетворюється за деяким дискретним виразом, основою якого є тригонометричні функції;",
      "символи вхідного тексту переставляються за деякою тригонометричною функцією;",
      "символи вхідного тексту заміняються на інші символи за допомогою аналітичного виразу."
    ]
  },
  {
    "question": "Для побудови яких криптосистем використовуються так звані однонаправлені функції (не зворотні)?",
    "answers": [
      "з відкритим ключем;",
      "з закритим ключем;",
      "з двома ключами;",
      "у яких не використовуються ключі."
    ]
  },
  {
    "question": "Що є характерною особливістю при застосуванні симетричної криптосистеми?",
    "answers": [
      "застосування одного і того ж секретного ключа як при шифруванні, так і при дешифруванні повідомлень;",
      "застосування одного відкритого ключа при шифруванні повідомлень, і закритого – при їх дешифруванні;",
      "застосування двох секретного ключів – одного при шифруванні, а іншого при дешифруванні повідомлень;",
      "застосування так званих однонаправлених функцій (не зворотних)."
    ]
  },
  {
    "question": "Що належить до традиційних (класичних) методів шифрування, що характеризуються симетричною функцією шифрування?",
    "answers": [
      "метод переставляння, шифри простої та складної заміни (підставляння) та деякі їх модифікації;",
      "метод гамування, так звані однонаправлені функції (не зворотні) та деякі їх модифікації;",
      "метод колокацій, так звані тригонометричні функції та деякі їх модифікації;",
      "метод подвійної заміни, так звані мультимедійні функції та деякі їх модифікації."
    ]
  },
  {
    "question": "Що називається магічним квадратом?",
    "answers": [
      "квадратні таблиці з вписаними в їх клітини послідовними натуральними числами, починаючи від 1, які дають в сумі закожним стовпцем, кожним рядком і кожною діагоналлю одне і те ж число;",
      "квадратні таблиці з вписаними в їх клітини послідовними двійковими числами, які дають в сумі закожним стовпцем, кожним рядком і кожною діагоналлю одне і те ж число;",
      "матриця з вписаними в їх клітини послідовними натуральними числами в хаотичному порядку, які дають змогу шифрувати та дешифрувати вхідне повідомлення;",
      "матриця з вписаними в їх клітини дійсними числами в певному порядку, які дають змогу шифрувати та дешифрувати вхідне повідомлення."
    ]
  },
  {
    "question": "Для якого захисту інформації використовуються криптографічні перетво¬рення?",
    "answers": [
      "вони забезпечують недоступність інформації для осіб, що не мають ключа і підтримують з необхідною надійністю виявлення несанкціонованих спотворень;",
      "вони забезпечують доступність інформації для осіб, що мають ключі (де)шифрування та підтримують надійність виявлення несанкціонованих спотворень;",
      "вони призначені для шифрування/дешифрування певної інформації за допомогою одного ключа;",
      "вони призначені для шифрування/дешифрування певної інформації за допомогою двох ключів."
    ]
  },
  {
    "question": "ЩоНЕ використовують безключові алгоритми (де)шифрування?",
    "answers": [
      "не використовують будь-яких ключів у процесі криптографічних перетворень;",
      "не використовують в своїх обчисленнях відкритих ключів, позаяк секретний ключ відсутній;",
      "не використовують в своїх обчисленнях секретних ключів;",
      "не використовують секретних ключів у процесі криптографічних перетворень."
    ]
  },
  {
    "question": "Щовикористовують одноключові алгоритми(де)шифрування?",
    "answers": [
      "використовують у процесі криптографічних перетворень тільки деякий секретний ключ;",
      "використовують в своїх обчисленнях тільки відкритий ключ, а секретний ключ відсутній;",
      "використовують в своїх обчисленнях тільки деякий відкритий ключ;",
      "використовують тільки аналітичні функції у процесі криптографічних перетворень."
    ]
  },
  {
    "question": "Щовикористовують двоключові алгоритми(де)шифрування?",
    "answers": [
      "використовують на різних етапах криптографічних перетворень два ключі – секретний та відкритий;",
      "використовують так звані однонаправлені функції (не зворотні) у процесі криптографічних перетворень;",
      "використовують в своїх обчисленнях два відкритих ключі, один з яких відомий тільки отримувачу інформації;",
      "використовують тільки тригонометричні функції у процесі криптографічних перетворень."
    ]
  },
  {
    "question": "Що використовують так звані хеш-функціїу криптографічних перетвореннях?",
    "answers": [
      "операцію \"згортання\" даних змінної довжини в послідовність фіксованого розміру;",
      "процедуру обмеженого доступу до інформації для осіб, що не мають ключів (де)шифрування;",
      "процедуру забезпечення надійності процесу шифрування/дешифрування певної інформації;",
      "операцію конфіденційності процесу шифрування/дешифрування певної інформації."
    ]
  },
  {
    "question": "Для якого захисту інформаціїінформації використовуються хеш-функції?",
    "answers": [
      "для підтвердження цілісності будь-яких даних у тих випадках, коли використання електронного підпису неможливе (наприклад, з-за великої ресурсомісткості) або є зайвим;",
      "у таких схемах електронного підпису, де підписуються так звані хеш-дані, а не повністю всі дані;",
      "у тих схемах автентифікації користувачів, коли у них відсутні ключів (де)шифрування;",
      "у тих схемах автентифікації користувачів, коли у них відсутній цифровий підпис."
    ]
  },
  {
    "question": "Що передбачає мережа Фейстеля (Feistelnetwork) під час (де)шифрування вхідних даних?",
    "answers": [
      "передбачає розбиття оброблюваного блоку даних на декілька субблоків (найчастіше – на два), один з яких обробляється деякою функцією f() і накладається на один або декілька наступних субблоків;",
      "передбачає розбиття блоку вхідних даних на декілька субблоків (найчастіше – на два), один з яких накладається на один або декілька наступних субблоків;",
      "передбачає розбиття оброблюваного блоку даних на чотири субблоки, тільки один з яких обробляється деякою функцією f() і накладається на декілька наступних субблоків;",
      "передбачає розбиття блоку вхідних даних на чотири субблоки, кожен з яких у подальших раундах міняється місцями з попередніми за певним алгоритмом."
    ]
  },
  {
    "question": "У яких схемах захисту інформації використовуються хеш-функції?",
    "answers": [
      "у деяких схемах електронного підпису – підписуються зазвичай хеш-дані, а не повністю всі дані;",
      "у деяких схемах біометричної автентифікації користувачів;",
      "у деяких схемах криптографічної автентифікації користувачів;",
      "у схемах підтвердження доступності даних, коли використання електронного підпису є зайвим."
    ]
  },
  {
    "question": "Для чого використовуються генератори випадкових чисел?",
    "answers": [
      "для генерування секретних ключів шифрування, якізагалом мають бути абсолютно випадковими;",
      "для задавання параметрів електронного цифрового підпису;",
      "для задавання вхідних параметрів алгоритмів автентифікації користувачів;",
      "для задавання вхідних даних при застосуванні електронного цифрового підпису."
    ]
  },
  {
    "question": "Що є основною особливістю алгоритмів симетричного шифрування?",
    "answers": [
      "в них для (де)шифрування вхідних даних використовується один і той самий ключ, або ключ дешифрування легко обчислюється з ключа шифрування;",
      "в них для (де)шифрування вхідних даних використовується два різні ключі – один відкритий, інший – секретний;",
      "в них для (де)шифрування вхідних даних використовується два різні ключі – обидва секретні;",
      "в них для (де)шифрування не використовується жодних ключів."
    ]
  },
  {
    "question": "Що розуміється під блоковим шифруванням?",
    "answers": [
      "вхідна інформація розбивається на блоки фіксованої довжини (наприклад, 64 або 128 біт), після чого над ними виконується послідовне шифрування;",
      "вхідна інформація розбивається на блоки різної довжини (наприклад, 16, 32, 64 або 128 біт), після чого над ними виконується послідовне шифрування;",
      "вхідна інформація розбивається на певні блоки фіксованої довжини, після чого над ними виконується безключові криптографічні перетворення;",
      "вхідна інформація розбивається на певні блоки фіксованої довжини, після чого над ними виконується одноключові криптографічні перетворення."
    ]
  },
  {
    "question": "Коли використовуються алгоритми потокового шифрування?",
    "answers": [
      "тоді, коли вхідну інформацію неможливо розбити на блоки фіксованої довжини;",
      "тоді, коли вхідну інформацію можна розбити на блоки різної довжини (наприклад, 16, 32 та 64 біт);",
      "тоді, коли вхідна інформація надходить не послідовно, а з певним інтервалом часу;",
      "тоді, коли фрагменти вхідної інформації надходить не дотримуючись певної послідовності."
    ]
  },
  {
    "question": "Які основні завдання алгоритмів автентифікації?",
    "answers": [
      "дають змогу перевірити, що користувач (або віддалений комп'ютер) дійсно є тим, за кого себе видає;",
      "забезпечують перевірку користувача (або віддаленого комп'ютера) на відсутність шкідливого програмного забезпечення;",
      "забезпечують перевірку користувача (або віддаленого комп'ютера) на наявність відповідних ключів;",
      "гарантують перевірку користувача (або віддаленого комп'ютера) на можливість передачі/прийняття даних."
    ]
  },
  {
    "question": "Яка найпростіша схема використовується для автентифікації користувача (або віддаленого комп'ютера)?",
    "answers": [
      "парольна схема, яка не вимагає наявності будь-яких криптографічних ключів;",
      "біометрична схема, яка не вимагає наявності будь-яких відбитків пальців;",
      "стереофонічна схема, яка не вимагає наявності будь-яких зразків голосу;",
      "пневматична схема, яка не вимагає наявності будь-яких зразків епідермосу."
    ]
  },
  {
    "question": "Що є основною особливістю алгоритмів асиметричного шифрування?",
    "answers": [
      "застосовують два види ключів: відкритий для шифрування вхідної інформації та секретний – для її дешифрування;",
      "застосовують два види різних ключів: закритий для шифрування вхідної інформації та відкритий – для її дешифрування;",
      "в них для (де)шифрування вхідних даних використовується два різні ключі – обидва секретні;",
      "в них для (де)шифрування не використовується жодних ключів."
    ]
  },
  {
    "question": "Що є основною особливістю алгоритмів електронного цифрового підпису?",
    "answers": [
      "використовують секретний ключ для обчислення цифрового підпису даних, а обчислений з нього відкритий – для його перевірки;",
      "використовують відкритий ключ для обчислення цифрового підпису даних, а обчислений з нього секретний – для його перевірки;",
      "в них для (де)шифрування вхідних даних використовується два різні ключі – обидва секретні;",
      "в них для (де)шифрування не використовується жодних ключів."
    ]
  },
  {
    "question": "Яку основну мету криптографічних атак на алгоритм шифрування може переслідувати зловмисник?",
    "answers": [
      "знаходження відкритого тексту, маючи його в зашифрованому вигляді, але не маючи для його дешифрування секретного ключа;",
      "знаходження секретного ключа, маючи тільки відкритий текст, але не маючи для його дешифрування відкритого ключа;",
      "знаходження відкритого ключа, маючи тільки відкритий текст, але не маючи для його дешифрування секретного ключа;",
      "знаходження відкритого тексту шляхом застосування частотного аналізу символів зашифрованого повідомлення."
    ]
  },
  {
    "question": "Що таке ділочинство?",
    "answers": [
      "діяльність, яка займається документуванням та організацією роботи з документами під час управлінської діяльності;",
      "рух документів у установі з моменту їхнього одержання чи створення до закінчення виконання чи відправлення;",
      "кількість вхідних, внутрішніх і вихідних документів установи за визначений термін;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що таке документообігвустанові?",
    "answers": [
      "рух документів вустанові з моменту їхнього одержання чи створення до закінчення виконання чи відправлення;",
      "документи інформаційного характеру, що підтверджують факти та різні різні обставини діяльності установи;",
      "сукупність документів з певного з певного предмета;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що таке бланк документа?",
    "answers": [
      "стандартний аркуш із попередньо відтвореною на ньому постійною інформацією і місцем, відведеним для внесення змінної інформації;",
      "сукупність розташованих у певній послідовності реквізитів документа;",
      "модель побудови документа, що включає план розміщення реквізитів з визначенням їх місця і площі;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "У якому документі не вказується реквізит – назва виду документа?",
    "answers": [
      "лист;",
      "акт;",
      "протокол;",
      "наказ."
    ]
  },
  {
    "question": "Який реквізит пишеться на всіх документах окрім листів?",
    "answers": [
      "10-ий реквізит;",
      "11-ий реквізит;",
      "12-ий реквізит;",
      "13-ий реквізит."
    ]
  },
  {
    "question": "Що таке пояснювальна записка?",
    "answers": [
      "службовийдокумент, адресований керівникові даної чи вищої організації, в якому автор інформує про ситуацію, що склалася, про події й факти, котрі мали місце, про виконану роботу тощо, а також наводить висновки й пропозиції;",
      "службовий документ, в якому пояснюється зміст окремих положень основного документа (плану, звіту, проекту) чи причин якихось подій, фактів, провин;",
      "службовий документ, який містить опис та підтвердження тих чи інших фактів або подій.",
      "службовий документ, який містить опис та підтвердження тих чи інших фактів або подій."
    ]
  },
  {
    "question": "Хто підписує наказ?",
    "answers": [
      "керівник установи;",
      "заступник керівника установи;",
      "головний бухгалтер установи;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Які бувають реквізити?",
    "answers": [
      "постійні (обов'язкові) і змінні;",
      "організаційні та розпорядчі;",
      "прості та складні;",
      "типові та трафаретні."
    ]
  },
  {
    "question": "Ким проставляється дата на документі?",
    "answers": [
      "особою, яка його підписує;",
      "особою, яка його готувала;",
      "працівником канцелярії;",
      "особою, яка друкувала."
    ]
  },
  {
    "question": "Яка частина наказу починається словом \"НАКАЗУЮ\"?",
    "answers": [
      "розпорядча;",
      "констатувальна;",
      "вступна;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що відображається у резолюції?",
    "answers": [
      "результат розгляду документа;",
      "спосіб доказу;",
      "результат виконання документа;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як правильно треба ставити печатку?",
    "answers": [
      "щоб вона захоплювала частину назви посади;",
      "щоб вона захоплювала частину підпису;",
      "щоб вона захоплювала частину розшифровки підпису;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Скільки визначено реквізитів на організаційно-розпорядчому документі?",
    "answers": [
      "32реквізити;",
      "30реквізити;",
      "31реквізити;",
      "33реквізити."
    ]
  },
  {
    "question": "У якому випадку доповідну записку оформляють бланку установи?",
    "answers": [
      "коли вона зовнішня;",
      "коли вона внутрішня;",
      "у будь якому випадку;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "У якому випадку доповідну записку оформляють від руки на чистому аркуші паперу?",
    "answers": [
      "коли вона внутрішня;",
      "коли вона зовнішня;",
      "у будь якому випадку;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Які дані фіксуються у протоколі?",
    "answers": [
      "фіксується час, місце, мета, проведення зборів;",
      "підтверджується факти, певні положення;",
      "повідомляється про ситуацію, яка склалася;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як називаються окремий елемент організаційно-розпорядчого документа?",
    "answers": [
      "реквізити;",
      "формуляри;",
      "бланки;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Де проставляється дата, якщо документ складено НЕ на бланку установи?",
    "answers": [
      "ліворуч від підпису;",
      "праворуч від підпису;",
      "у лівій верхній частині документа разом з індексом;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Який повний перелік елементів грифу \"Затверджую\"?",
    "answers": [
      "слово \"ЗАТВЕРДЖУЮ\", назва посади, особистий підпис посадової особи, що затверджуєдокумент, її ініціали і прізвище, дата затвердження;",
      "слово \"ЗАТВЕРДЖУЮ\", особистий підпис особи, що затверджує документ, її ініціали і прізвище, дата затвердження;",
      "слово \"ЗАТВЕРДЖУЮ\", назва посади, особистий підпис особи, що затверджує документ, прізвище;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Де і як ставиться позначка про контроль?",
    "answers": [
      "на лівому полі першого аркуша документа (на рівні заголовка до тексту) пишеться слово \"Контроль\" або літера \"К\";",
      "на нижньому правому полі першого аркуша документа пишеться слово \"Контроль\"або літера \"К\";",
      "на нижньому лівому полі першого аркуша документа пишеться слово \"Контроль\" або літера\"К\";",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Який вид наказу зберігається в установі постійно?",
    "answers": [
      "наказ з основної діяльності;",
      "наказ з особового складу;",
      "наказ з оперативних питань;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Який вид наказу зберігається в установі 75 років?",
    "answers": [
      "наказ з особового складу;",
      "наказ з основної діяльності;",
      "наказ з оперативних питань;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Який вид наказу зберігається в установі до 3 років?",
    "answers": [
      "наказ з оперативних питань;",
      "наказ з основної діяльності;",
      "наказ з особового складу;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "На чому складають усі документи в установі?",
    "answers": [
      "на бланках;",
      "на зразках;",
      "на формулярах;",
      "на шаблонах."
    ]
  },
  {
    "question": "Що таке документ?",
    "answers": [
      "всі відповіді правильні;",
      "матеріальний об'єкт, що має інформацію в зафіксованому вигляді і спеціально призначений для її передачі у просторі;",
      "це діловий папір, що підтверджує будь-який факт або право на щось;",
      "всі відповіді не правильні."
    ]
  },
  {
    "question": "Що таке класифікація документів?",
    "answers": [
      "це поділ їх на класи за найбільш загальними ознаками схожості та відмінності;",
      "економія праці за рахунок використанні інформаційно-довідкового апарату;",
      "підвищення оперативності роботи апарату управління та відповідальності виконавців шляхом розмежування функцій;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Чим є комплексні системи захисту інформації та технічні/програмні засоби, які реалізують функції технічного захисту інформації, відносно державної експертизи?",
    "answers": [
      "об'єктами експертизи;",
      "суб'єктами експертизи;",
      "організаторами експертизи;",
      "власниками експертизи."
    ]
  },
  {
    "question": "Який термін проведення державної експертизи?",
    "answers": [
      "не більше 6 місяців;",
      "не менше 6 місяців;",
      "не більше 2 місяців;",
      "не менше 2 місяців."
    ]
  },
  {
    "question": "Що НЕ належить до виду категоріювання?",
    "answers": [
      "контрольне;",
      "первинне;",
      "чергове;",
      "позачергове."
    ]
  },
  {
    "question": "Скільки є видів категорій об'єктів?",
    "answers": [
      "4 види;",
      "3 види;",
      "5 види;",
      "6 види."
    ]
  },
  {
    "question": "До якої категорії належать об'єкти, в яких циркулює інформація, що містить відомості, які становлять державну таємницю, і для якої встановлено гриф секретності \"Особливої важливості\"?",
    "answers": [
      "1 категорії;",
      "2 категорії;",
      "3 категорії;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "До якої категорії належать об'єкти, в яких циркулює інформація, що містить відомості, які становлять державну таємницю, для якої встановлено гриф секретності \"Цілком таємно\"?",
    "answers": [
      "2 категорії;",
      "1 категорії;",
      "3 категорії;",
      "4 категорії."
    ]
  },
  {
    "question": "До якої категорії належать об'єкти, в яких циркулює інформація, що містить відомості, які становлять державну таємницю, і для якої встановлено гриф секретності \"Таємно\"?",
    "answers": [
      "немає правильної відповіді;",
      "1 категорії;",
      "2 категорії;",
      "4 категорії."
    ]
  },
  {
    "question": "До якої категорії належать об'єкти, на яких обробляється технічними засобами та озвучується інформація з обмеженим доступом, що не становить державної таємниці, конфіденційна?",
    "answers": [
      "4 категорії;",
      "3 категорії;",
      "2 категорії;",
      "1 категорії."
    ]
  },
  {
    "question": "Хто проводить категоріювання об'єкта інформаційної діяльності?",
    "answers": [
      "комісія призначена наказом керівника установи;",
      "фірма, яка має ліцензію для проведення робіт пов'язаних із захистом інформації;",
      "Держспецзв'язок;",
      "служба безпеки України."
    ]
  },
  {
    "question": "Через який термін треба робити повторне категоріювання?",
    "answers": [
      "5 років;",
      "3 роки;",
      "4 роки;",
      "7 років."
    ]
  },
  {
    "question": "Який документ складають за результатами проведення категоріювання об'єкта інформаційної діяльності?",
    "answers": [
      "акт;",
      "протокол;",
      "наказ;",
      "розпорядження."
    ]
  },
  {
    "question": "Скільки часу орган сертифікація розглядає заявку на проведення сертифікації засобу ТЗІ?",
    "answers": [
      "не пізніше одного місяця;",
      "не пізніше шести місяців;",
      "не пізніше двох місяців;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що НЕ належить організаційному захисту інформації?",
    "answers": [
      "криптографічне перетворення інформації;",
      "політика безпеки;",
      "використання ліцензійного програмного забезпечення;",
      "встановлення правил внутрішнього порядку."
    ]
  },
  {
    "question": "Яке джерело загроз є найпоширенішим?",
    "answers": [
      "антропогенне;",
      "природного характеру;",
      "техногенні навмисні;",
      "техногенні не навмисні."
    ]
  },
  {
    "question": "Що НЕ варто враховувати при побудові моделі порушника?",
    "answers": [
      "біометричні особливості;",
      "мотиви;",
      "рівень знань;",
      "час і місце."
    ]
  },
  {
    "question": "Якою категорією характеризується рівень збитків \"дуже значні\"?",
    "answers": [
      "4 категорією;",
      "3 категорією;",
      "2 категорією;",
      "1 категорією."
    ]
  },
  {
    "question": "Що з перелічених варіантів НЕ належить виду політики безпеки?",
    "answers": [
      "адміністраторська;",
      "мандатна;",
      "розмежувальна;",
      "рольова."
    ]
  },
  {
    "question": "Як іншими словами називають мандатну політику безпеки?",
    "answers": [
      "повноважна;",
      "розмежувальна;",
      "рольова;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Хто не може бути організатором державної експертизи?",
    "answers": [
      "комісія, яка складається з працівників установи замовника;",
      "фірми, що маєть ліцензію на діяльність пов'язану із ТЗІ;",
      "Держспецзв'язок;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що не може бути об'єктом інформаційної діяльності?",
    "answers": [
      "немає правильної відповіді;",
      "інженерно-технічна споруда;",
      "приміщення;",
      "транспортний засіб, де здійснюється озвучення інформації з обмеженим доступом."
    ]
  },
  {
    "question": "Як називається вид державної експертизи, яку проводять у випадку обґрунтованих претензій щодо порядку проведення або результатів експертизи?",
    "answers": [
      "контрольна;",
      "первинна;",
      "позапланова;",
      "претензійна."
    ]
  },
  {
    "question": "Що саме не відноситься виду державної експертизи?",
    "answers": [
      "позачергова;",
      "первинна;",
      "додаткова;",
      "контрольна."
    ]
  },
  {
    "question": "Який документ НЕ оформляється під час державної експертизи?",
    "answers": [
      "акт;",
      "атестат відповідності;",
      "протокол;",
      "заява."
    ]
  },
  {
    "question": "Що означає абревіатура \"ДТЗС\"?",
    "answers": [
      "допоміжні технічні засоби і системи;",
      "додаткові технічні засоби спостереження;",
      "державне товариство захисту систем;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Хто проводить сертифікацію засобів ТЗІ?",
    "answers": [
      "орган сертифікації;",
      "Держспецзв'язок;",
      "Держспоживстандарт;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як поділяться інформація за режимом доступу?",
    "answers": [
      "відкрита публічна та з обмеженим доступом;",
      "відкрита та закрита;",
      "відкрита і таємна;",
      "відкрита публічна і таємна."
    ]
  },
  {
    "question": "Яка інформація належить до інформації з обмеженим доступом?",
    "answers": [
      "комерційна, службова, таємна;",
      "таємна, відкрита, службова;",
      "конфіденційна, службова, таємна;",
      "конфіденційна, службова, державна."
    ]
  },
  {
    "question": "Яка інформація належить до таємної інформації?",
    "answers": [
      "державна таємниця;",
      "персональна таємниця;",
      "конфіденційна інформація;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Яка інформація НЕ належить до таємної інформації?",
    "answers": [
      "конфіденційна інформація;",
      "державна таємниця;",
      "таємниця слідства;",
      "нотаріальна таємниця."
    ]
  },
  {
    "question": "Який відсоток надбавки до посадового окладу отримує державний експерт з питань таємниць?",
    "answers": [
      "20 %;",
      "25 %;",
      "30 %;",
      "40 %."
    ]
  },
  {
    "question": "З яким грифом секретності документимають термін дії 30 років?",
    "answers": [
      "\"Особливої важливості\";",
      "\"Таємно\";",
      "\"Для службового користування\";",
      "\"Цілком таємно\"."
    ]
  },
  {
    "question": "З яким грифом секретності документи мають термін дії 10 років?",
    "answers": [
      "\"Цілком таємно\";",
      "\"Особливої важливості\";",
      "\"Таємно\";",
      "\"Для службового користування\"."
    ]
  },
  {
    "question": "З яким грифом секретності документи мають термін дії 5 років?",
    "answers": [
      "\"Для службового користування\";",
      "\"Особливої важливості\";",
      "\"Таємно\";",
      "\"Цілком таємно\"."
    ]
  },
  {
    "question": "З яким грифом секретності документи мають термін дії 3 роки?",
    "answers": [
      "\"Для службового користування\";",
      "\"Особливої важливості\";",
      "\"Таємно\";",
      "\"Цілком таємно\"."
    ]
  },
  {
    "question": "На який термін видають форму допуску-2 для роботи із таємною інформацією?",
    "answers": [
      "7 років;",
      "5 років;",
      "10 років;",
      "3 роки."
    ]
  },
  {
    "question": "На який термін видають форму допуску-1 для роботи із таємною інформацією?",
    "answers": [
      "5 років;",
      "7 років;",
      "10 років;",
      "3 роки."
    ]
  },
  {
    "question": "На який термін видають форму допуску-3 для роботи із таємною інформацією?",
    "answers": [
      "10 років;",
      "7 років;",
      "5 років;",
      "3 роки."
    ]
  },
  {
    "question": "Хто надає допуск до державної таємниці?",
    "answers": [
      "Служба безпеки України;",
      "Державна служба спеціального зв'язку та захисту інформації;",
      "керівник установи;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Хто надає доступ до державної таємниці?",
    "answers": [
      "керівник установи;",
      "Служба безпеки України;",
      "Державна служба спеціального зв'язку та захисту інформації;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як карається розголошення відомостей, що становлять державну таємницю, особою, якій ці відомості були довірені за відсутності ознак державної зради або шпигунства?",
    "answers": [
      "позбавлення волі на термін від 2 до 5 років;",
      "позбавлення волі на термін від 2 до 4 років;",
      "позбавлення волі на термін від 5 до 10 років;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як карається розголошення відомостей, що становлять державну таємницю, особою, якій ці відомості були довірені та спричинило тяжкі наслідки?",
    "answers": [
      "позбавлення волі на термін від 5 до 8 років;",
      "позбавлення волі на термін від 2 до 4 років;",
      "позбавлення волі на термін від 5 до 10 років;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як карається втрата документів або інших матеріальних носіїв секретної інформації, що містять державну таємницю, які не спричинили тяжких наслідків?",
    "answers": [
      "позбавлення волі на термін до 3 років;",
      "позбавлення волі на термін до 5 років;",
      "позбавлення волі на термін до 8 років;",
      "позбавлення волі на термін до 10 років."
    ]
  },
  {
    "question": "Як карається втрата документів або інших матеріальних носіїв секретної інформації, що містять державну таємницю, які спричинили тяжкі наслідки?",
    "answers": [
      "позбавлення волі на термін від 2 до 5 років;",
      "позбавлення волі на термін від 1 до 5 років;",
      "позбавлення волі на термін від 4 до 8 років;",
      "позбавлення волі на термін від 6 до 10 років."
    ]
  },
  {
    "question": "У яких випадках покарання за може бути обмеження волі?",
    "answers": [
      "передачі або збирання відомостей становлять державну таємницю;",
      "розголошення відомостей що становлять державну таємницю;",
      "втрата матеріальних носіїв секретної інформації;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Як карається передача або збирання інформації з обмеженим доступом з метою передачі іноземним організаціям за відсутності ознак державної зради або шпигунства?",
    "answers": [
      "обмеження волі на термін до 3 років або позбавленням волі на термін від 2 до 5 років;",
      "позбавлення волі на термін від 3 до 5 років;",
      "позбавлення волі на термін від 1 до 3 років;",
      "позбавлення волі на термін від 4 до 8 років."
    ]
  },
  {
    "question": "Як карається передача або збирання інформації з обмеженим доступом з метою передачі іноземним організаціям, які спричинили тяжкі наслідки для інтересів держави?",
    "answers": [
      "позбавленням волі на термін від 4 до 8 років;",
      "обмеження волі на термін до 3 років або позбавленням волі на термін від 2 до 5 років;",
      "позбавлення волі на термін від 3 до 5 років;",
      "позбавлення волі на термін від 1 до 3 років."
    ]
  },
  {
    "question": "Де мають зазначити реквізит \"Для службового користування\", якщо його неможливо нанести безпосередньо на матеріальний носій секретної інформації?",
    "answers": [
      "у супровідному документі;",
      "у конверті;",
      "у службовому листі;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "З якого віку надають допуск громадянам України?",
    "answers": [
      "18 років;",
      "19 років;",
      "20 років;",
      "21 років."
    ]
  },
  {
    "question": "Як називається відділ, який здійснює обробку таємної інформації?",
    "answers": [
      "режимно-секретний орган;",
      "служба безпеки України;",
      "Держспецзв'язок;",
      "канцелярія."
    ]
  },
  {
    "question": "Хто здійснює засекречування матеріальних носіїв секретної інформації?",
    "answers": [
      "державний експерт з питань таємниць;",
      "працівник режимно-секретного органу;",
      "працівник служби безпеки України;",
      "працівник Держспецзв'язку."
    ]
  },
  {
    "question": "Де проставляють гриф \"ДСК\" на документах?",
    "answers": [
      "у правому верхньому куті;",
      "у лівому верхньому куті;",
      "по середині документа;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "В якому модулі системи Statistica можна знайти параметри лінійної функції?",
    "answers": [
      "multiplyregretion;",
      "nonlinearestimation;",
      "basicstatisticandtables;",
      "factoranalysis."
    ]
  },
  {
    "question": "Потрібно зайти у менюсистемі Statistica, щоб обчислити прогнозовані значення напередна 2 роки?",
    "answers": [
      "statistics-advansed linear/nonlinear-time series and forecasting-ecsponensial smoothing and forecasting;",
      "statistics-claster analysis;",
      "statistics-descriptive analisys-factor analysis;",
      "statistics-basic statistic and tables-descriptive statistics."
    ]
  },
  {
    "question": "Що потрібно здійснити, щоб змінити властивості та назву колонки в системі Statistica?",
    "answers": [
      "двічі клікнути на шапці відповідної колонки;",
      "виділити всю колонку, натиснути праву клавішу миші і з випадаючого підменю вибрати пункт editvariabler;",
      "навести курсор миші на шапку відповідної колонки і натиснути клавішу enter;",
      "навести курсор миші на шапку відповідної колонки і вибрати меню edit-formatcells."
    ]
  },
  {
    "question": "В якому модулі системи Statistica можна знайти параметри однофакторної функції?",
    "answers": [
      "nonlinearestimation;",
      "multiplyregretion;",
      "factoranalysis;",
      "clusteranalysis."
    ]
  },
  {
    "question": "В якому модулі системи Statistica можна знайти параметри нелінійної функції?",
    "answers": [
      "nonlinearestimation;",
      "basicstatisticandtables;",
      "multiplyregretion;",
      "factoranalysis."
    ]
  },
  {
    "question": "Яким способом можна ввести дані в електронну таблицю системи Statistica?",
    "answers": [
      "всі відповіді правильні;",
      "обчислити нові дані на основі вже введених за допомогою формул, які можна задати в електронній таблиці;",
      "використати механізм динамічного зв'язку dde між даними в Statistica та іншим windows-додатком;",
      "безпосередньо ввести вихідні дані з клавіатури."
    ]
  },
  {
    "question": "В якому діалоговому вікні можна задати формат значень змінних?",
    "answers": [
      "сreatenewfile;",
      "timeseriesanalysis;",
      "selectthevariablesforthetimeseriesanalyses;",
      "opendatafile."
    ]
  },
  {
    "question": "За допомогою якої кнопки в стартовій панелі модуля \"Часові ряди і прогнозування\" можна вибрати змінні для аналізу?",
    "answers": [
      "variables;",
      "opendata;",
      "selectcases;",
      "interruptedtimeseriesanalysis."
    ]
  },
  {
    "question": "Скільки параметрів має однофакторна модель?",
    "answers": [
      "2 параметри;",
      "1 параметр;",
      "3 параметри;",
      "4 параметри."
    ]
  },
  {
    "question": "Скільки параметрів має класична модель Кобба-Дугласа?",
    "answers": [
      "3 параметри;",
      "2 параметри;",
      "1 параметр;",
      "4 параметри."
    ]
  },
  {
    "question": "Коли параметр функції вважається значущим?",
    "answers": [
      "коли p-level<0.05;",
      "коли p-level=0.05;",
      "коли p-level>0.05;",
      "коли p-level=0."
    ]
  },
  {
    "question": "Що показує значення коефіцієнта кореляції \"-0,96\"?",
    "answers": [
      "зв'язок між двома факторами є обернено-пропорційний і значущий;",
      "зв'язок між двома факторами є прямо-пропорційний і значущий;",
      "зв'язок між двома факторами є прямо-пропорційний і незначущий;",
      "зв'язок між двома факторами є обернено-пропорційний і незначущий."
    ]
  },
  {
    "question": "Що показує значення коефіцієнта кореляції \"0\"?",
    "answers": [
      "немає правильної відповіді;",
      "зв'язок між двома факторами є прямо-пропорційний і значущий;",
      "зв'язок між двома факторами є прямо-пропорційний і незначущий;",
      "зв'язок між двома факторами є обернено-пропорційний і незначущий."
    ]
  },
  {
    "question": "Що показує значення коефіцієнта детермінації \"0,81\"?",
    "answers": [
      "зміна параметрів на 81% залежить від них самих, а на 19% від зміни зовнішніх факторів;",
      "зміна параметрів на 19% залежить від них самих, а на 81% від зміни зовнішніх факторів;",
      "зв'язок між двома параметрами є прямо-пропорційний і рівний 81%;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Які розрізняють прогнози за класифікаційною ознакою \"кількісна оцінка\"?",
    "answers": [
      "інтервальні, точкові;",
      "детерміновані, змішані, стохастичні;",
      "науково-технічні, демографічні, соціальні;",
      "дискретні, аперіодичні, циклічні."
    ]
  },
  {
    "question": "Які виділяють прогнози за ознакою \"період упередження\"?",
    "answers": [
      "коротко-, середньо-, довготермінові;",
      "детерміновані, змішані, стохастичні;",
      "дискретні, аперіодичні, циклічні;",
      "науково-технічні, демографічні, соціальні."
    ]
  },
  {
    "question": "Які методи містять інтуїтивні методи прогнозування?",
    "answers": [
      "всі відповіді правильні;",
      "метод колективного генерування ідей;",
      "матричний метод;",
      "метод Дельфі."
    ]
  },
  {
    "question": "Що передбачає загальний прогноз?",
    "answers": [
      "відповідь на питання щодо можливості настання деякої ситуації;",
      "визначення числових оцінок майбутньої ситуації;",
      "опис майбутньої ситуації;",
      "всі відповіді правильні."
    ]
  },
  {
    "question": "Як розрізняють прогнози за трендовою характеристикою розвитку процесів у часі?",
    "answers": [
      "дискретні, аперіодичні, циклічні;",
      "детерміновані, змішані, стохастичні;",
      "коротко-, середньо-, довготермінові;",
      "науково-технічні, демографічні, соціальні."
    ]
  },
  {
    "question": "Що собою представляє метод двох крайніх точок?",
    "answers": [
      "метод прогнозування по прямій, проведеній через дві крайні точки;",
      "метод прогнозування для значень показників якого-небудь ряду усередині періоду спостережень між двома крайніми точками;",
      "метод прогнозування на основі інтерполяційного полінома;",
      "один з видів експертного методу прогнозування."
    ]
  },
  {
    "question": "Якою є ступінь узгодженості експертів, якщо коефіцієнт кореляції Спірменастановить 0,8?",
    "answers": [
      "високою;",
      "помірною;",
      "помітною;",
      "слабкою."
    ]
  },
  {
    "question": "Що показує коефіцієнт кореляції Кендала?",
    "answers": [
      "тісноту зв'язку між двома експертами;",
      "тісноту зв'язку між всіма експертами;",
      "рівень похибки експертної групи;",
      "взаємовідносини в експертній групі."
    ]
  },
  {
    "question": "На основі якого коефіцієнту оцінюється ступінь узгодженості думок двох експертів?",
    "answers": [
      "коефіцієнту Спірмена;",
      "коефіцієнту конкордації;",
      "коефіцієнту лінійної кореляції;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "В чому полягає основна відмінність між методи \"Дельфі\" і \"Мозкової атаки\"?",
    "answers": [
      "у генерування нових ідей;",
      "у досягненні згоди групи експертів;",
      "у опитуванні експертів у кілька турів;",
      "немає правильної відповіді."
    ]
  },
  {
    "question": "Що може робити експерт у процесі прогнозування?",
    "answers": [
      "всі відповіді правильні;",
      "використовувати свій досвід і знання;",
      "впливати на розвиток аналізованого процесу;",
      "досліджувати вплив економічних змінних на даний процес."
    ]
  },
  {
    "question": "В чому полягає сутність методології моделювання?",
    "answers": [
      "заміні вихідного об'єкта його \"образом\" – математичною моделлю – і подальшим вивченням моделі;",
      "розробленні моделі об'єкта за допомогою комп'ютерних програм, для того щоб в подальшому її добавити до об'єкта;",
      "створенні моделі об'єкта за допомогою математичних операторів з метою заміщення негативних сторін об'єкта елементами моделі;",
      "вибір алгоритму для реалізації моделі на комп'ютері."
    ]
  },
  {
    "question": "Що відбувається на другому етапі математичного моделювання?",
    "answers": [
      "вибір алгоритму для реалізації моделі на комп'ютері;",
      "обирається \"еквівалент\" об'єкта, що відображає в математичній формі найважливіші його властивості;",
      "створюються програми, що \"переносять\" модель і алгоритм на доступну комп'ютерну мову;",
      "реалізація алгоритму моделювання."
    ]
  },
  {
    "question": "Як поділяються експертні методи прогнозування?",
    "answers": [
      "індивідуальні та колективні;",
      "особистісні та групові;",
      "особистісні та колективні;",
      "індивідуальні та групові."
    ]
  },
  {
    "question": "Що визначають чинники, які впливають на вибір стратегії прогнозування експертом?",
    "answers": [
      "мотивація;",
      "досвід;",
      "отримані результати;",
      "знання."
    ]
  },
  {
    "question": "Яка з запропонованих характеристик є притаманною часовим рядам:",
    "answers": [
      "сезонність;",
      "повторюваність;",
      "хаотичність;",
      "статичність."
    ]
  },
  {
    "question": "Інформаційно-телекомунікаційна система це",
    "answers": [
      "сукупністьінформаційних та телекомунікаційних систем, призначених для обміну та обробкиінформації;",
      "сукупністьтехнічних і програмнихзасобів, призначених для обмінуінформацією;",
      "організаційно-технічна система, в якійреалізуєтьсятехнологіяобробкиінформації;",
      "організаційно-технічна система, щопоєднує в собіобчислювальну систему, персонал, інформацію для обробки."
    ]
  },
  {
    "question": "Типовірівніроботи ІКС",
    "answers": [
      "мережі, ОС, СКБД, ПЗ;",
      "апаратний, програмний, програмноапаратний;",
      "процесорний, баз даних, відеотерміналів;",
      "комунікаційний, комутативний, протокольний."
    ]
  },
  {
    "question": "Апаратнізасобизабезпеченнязахисту (АЗЗЗ) комп’ютерноїсистемице",
    "answers": [
      "засобипідтримкифункційзахистуопераційних систем, яківбудовано в процесор тамікросхемисистемної плати;",
      "програмні та перепрограмованізасоби для підтримкифункційзахистукомп’ютерноїсистеми;",
      "програмнімодуліоброблювачівпереривань;",
      "засоби, щовиконуютьфункціїкерування та взаємодіїміж процессами."
    ]
  },
  {
    "question": "Утилітибезпеки",
    "answers": [
      "спеціальнорозробленіпрограми для виконанняпевнихзавданьадмініструваннябезпеки;",
      "програми, щовідповідають за файлову систему;",
      "програми для вилученняфайлів в системі;",
      "спеціальнорозробленіпрограми для оглядунаявноїінформації."
    ]
  },
  {
    "question": "Скількирівнів систем захисту ІТКС",
    "answers": [
      "чотири;",
      "три;",
      "два;",
      "один."
    ]
  },
  {
    "question": "Скількиспособівпідтвердженняістинностікористувачаперевіряють в підсистеміідентифікації та автентифікації",
    "answers": [
      "три;",
      "два;",
      "чотири;",
      "один."
    ]
  },
  {
    "question": "Збереженняцінностіінформаційнихресурсівзабезпечуєзахист в ІТКС таких властивостейінформації",
    "answers": [
      "цілісності, конфіденційності, доступності;",
      "цілісності, неперервності;",
      "конфіденційності, несприятливоговпливу;",
      "недоступності, невразливості."
    ]
  },
  {
    "question": "Здійсненняподоланнязасобівзахисту ІТКС це",
    "answers": [
      "проникнення,",
      "загроза,",
      "вразливість,",
      "керованість."
    ]
  },
  {
    "question": "Елементресурсівобчислювальноїсистемипідкеруванням КЗЗ,щохарактеризуєтьсявизначеними атрибутами, це",
    "answers": [
      "об’єктсистеми;",
      "інформаційнийнесанкціонованийпотік;",
      "комп’ютерні закладки;",
      "сканер уразливості."
    ]
  },
  {
    "question": "Скільки є вимогзахищеності ОС відповідно классу С2 за TCSEC",
    "answers": [
      "чотири;",
      "три;",
      "два;",
      "один."
    ]
  },
  {
    "question": "До компонентів КЗЗ Windows не входить",
    "answers": [
      "утилітибезпеки;",
      "диспетчер облікових записів SAM;",
      "підсистема локальної автентифікації Lsass;",
      "служба каталогів AD."
    ]
  },
  {
    "question": "Під час інсталяції ОС Windows автоматично створює визначені наперед за замовчуванням",
    "answers": [
      "10 суб’єктів доступу;",
      "8 суб’єктів доступу;",
      "12 суб’єктів доступу;",
      "13 суб’єктів доступу."
    ]
  },
  {
    "question": "ОС Windows створюється стандартні типи",
    "answers": [
      "13 об’єктів доступу;",
      "12 об’єктів доступу;",
      "11 об’єктів доступу;",
      "10 об’єктів доступу."
    ]
  },
  {
    "question": "Яке призначення об’єкта синхронізації Semaphores",
    "answers": [
      "обмеженнякількостіодночаснихзвернень різних потоків до одного об’єкта ОС;",
      "асинхронного звернення до файлових систем в пристроїв;",
      "під час передавання повідомлень від одного процесу до іншого;",
      "виключення одночасного доступу кількох потоків до одного об’єкта ОС."
    ]
  },
  {
    "question": "ОС Windows створює визначені наперед за замовчуванням права доступу для",
    "answers": [
      "3 груп;",
      "4 груп;",
      "5 груп;",
      "7 груп."
    ]
  },
  {
    "question": "Windows підтримує 22 методи доступу суб’єктів до об’єктів, скільки стандартних методів підтримують доступи до всіх об’єктів",
    "answers": [
      "6 методів;",
      "4 методів;",
      "3 методів;",
      "2 методів."
    ]
  },
  {
    "question": "Для ідентифікації активних об’єктів (суб’єктів) ОС Windows використовують ідентифікатори захисту SID, що не присвоюються",
    "answers": [
      "процесору;",
      "користувачам;",
      "групам домену;",
      "локальним комп’ютерам;"
    ]
  },
  {
    "question": "Що вказує, які безпечні дії можна виконувати над об’єктом ОС Windows",
    "answers": [
      "дискриптор захисту SD;",
      "монітор безпеки SRM;",
      "ідентифікатори захисту SID;",
      "диспетчер облікових записів SAM."
    ]
  },
  {
    "question": "Що вказує, які операції доступу до об’єкта та яких користувачів слід реєструвати в журналі аудиту безпеки",
    "answers": [
      "системний список керування доступом SACL;",
      "список керування доступом ACL;",
      "елементи контролю доступу ACE;",
      "список дискреційногокерування доступом DACL."
    ]
  },
  {
    "question": "Якийз алгоритмівWin-32 застосовують для з’ясування прав доступу 1)GetEffectiveRightsformAcl, 2) AccessCheckByType",
    "answers": [
      "перший та другий;",
      "перший;",
      "другий;",
      "жодного."
    ]
  },
  {
    "question": "Яка функція застосовується для подій аудиту Windows, що керує файлом журналу безпеки та переглядає та змінює SACL",
    "answers": [
      "SeSecurityPrivilege;",
      "SeAudit Privilege",
      "GetEffectiveRightsformAcl;",
      "AccessCheckByType;"
    ]
  },
  {
    "question": "Які засоби використовуються для добирання паролів як однієї з загроз безпеці ОС",
    "answers": [
      "ідентифікації й автентифікації;",
      "реєстрації й обліку (аудит);",
      "криптографічних функцій;",
      "антивірусного захисту."
    ]
  },
  {
    "question": "Скільки принципів покладено в основу створення захищених ОС",
    "answers": [
      "п’ять;",
      "чотири;",
      "три;",
      "два;"
    ]
  },
  {
    "question": "До якихадміністративнихзаходіввідноситьсяреєстраціяподій у системі (EventLogging)",
    "answers": [
      "постійний контроль коректностіфункціонування ОС;",
      "організаціяадекватноїполітикибезпеки;",
      "навчаннякористувачів;",
      "створеннярезервнихкопій;"
    ]
  },
  {
    "question": "Скільки основних функцій виконує комплекс засобів захисту ОС",
    "answers": [
      "вісім;",
      "сім;",
      "п’ять;",
      "чотири;"
    ]
  }
];